org/setup.org
# -*- mode:org; coding: utf-8; -*-
#+TITLE: Setup runcom
#+SETUPFILE: header.org
#+PROPERTY: header-args :mkdirp t :results no :eval no

* Headers
#+begin_src bash :shebang #!/usr/bin/env sh :tangle ../setup/dependencies.sh :noweb yes :eval yes :exports none
  <<header.org:banner()>>
#+end_src

#+begin_src bash :shebang #!/usr/bin/env sh :tangle ../setup/setup.sh :noweb yes :eval yes :exports none
  <<header.org:banner()>>
#+end_src

#+begin_src bash :shebang #!/usr/bin/env sh :tangle ../setup/unset.sh :noweb yes :eval yes :exports none
  <<header.org:banner()>>
#+end_src

* Legend
** Brackets
- *Square* =[]=: optional parts: =W[orld]H[ealth]O[rganisation]=
- *Angular* =<>=: instructions to fill: =<a global organisation>=
- *Curly*, following a dollar =${}=: environment variable =${HOME}=
- *Round*, with bar separator: =(WHO|UNO)= = /WHO or UNO/

* Requirements
** Knowledge
- Linux shell commands. We shall try to be POSIX-compliant
- Knowledge of Linux, "dot-files"
- super user (sudo) permissions (only for package installation)
#+begin_warning
Avoid *sudo* as much as possible.
#+end_warning

** Dependencies
- A GNU/Linux distribution.
  I use [[https://archlinux.org][arch]] [[https://knowyourmeme.com/memes/btw-i-use-arch][btw]].
- GNU [[https://www.gnu.org/software/coreutils/coreutils.html][coreutils]]: Basic OS utilities.
- [[https://curl.se/][curl]] for proxy authentication.
- GNU [[https://www.gnu.org/software/stow/][stow]]: dot-file management
- [[https://git-scm.com/][git]]: git it.

#+begin_important
For Alpine Linux, [[/etc/apk/repositories][enable]] the [[https://<mirror-server>/alpine/<version>/community][community repository]].
- If you are using Alpine, you *MUST* know how.
#+end_important

*** Bootstrap installation of dependencies
For automated installation of dependencies, run the [[./setup/dependencies.sh][dependencies script]] with elevated privileges.
#+begin_src sh :tangle no
  curl -sLf "https://pradyparanjpe.gitlab.io/runcom/setup/dependencies.sh" | sudo sh
#+end_src

#+begin_note
Inspecting scripts before running them (especially with =sudo=) is always a good idea.
The /dependencies/ script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, install dependencies manually instead, that's all it does.
#+end_note

*** Guide for manual installation of dependencies.
Use suitable package manager ([[https://wiki.debian.org/Apt][apt]]|[[https://pkgs.alpinelinux.org/packages][apk]]|[[https://docs.fedoraproject.org/en-US/fedora/latest/system-administrators-guide/package-management/DNF/][dnf]]|[[https://archlinux.org/pacman/][pacman]]|[[https://documentation.suse.com/smart/linux/html/concept-zypper/index.html][zypper]]) to install coreutils, curl, git, stow.
It may be useful to update existing packages and repository database before installing packages.
#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  #!/usr/bin/env sh
  # -*- coding: utf-8; mode: shell-script; -*-
  dnf_install() {
#+end_src

**** dnf: Fedora, RockyLinux, RHEL, CentOS
#+begin_src sh :tangle ../setup/dependencies.sh
  dnf -y update || return 65
  dnf -y install coreutils curl git stow || return 66
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }

   apk_install() {
#+end_src

**** apk: Alpine Linux
#+begin_src sh :tangle ../setup/dependencies.sh
  apk update || return 65
  apk --virtual runcom add coreutils curl git stow || return 66
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }

   apt_install() {
#+end_src

**** apt: Debian, Ubuntu
#+begin_src sh :tangle ../setup/dependencies.sh
  apt update || return 65
  apt install -y coreutils curl git stow || return 66
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }

   zypper_install() {
#+end_src

**** zypper: OpenSuSE, SuSE
#+begin_src sh :tangle ../setup/dependencies.sh
  zypper ref || return 65
  zypper -n install coreutils curl git stow || return 66
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }

   pacman_install() {
#+end_src

**** pacman: Arch, Manjaro
#+begin_src sh :tangle ../setup/dependencies.sh
  pacman --noconfirm -Syu coreutils curl git stow || return 65
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }

   brew_install() {
#+end_src

**** brew: Mac (untested)
#+begin_src sh :tangle ../setup/dependencies.sh
  brew update || return 65
  brew install coreutils curl git stow || return 66
#+end_src

#+begin_src sh :tangle ../setup/dependencies.sh :exports none
  }
   guess_manager() {
       for manager in apt apk dnf pacman zypper brew; do
           if command -v "${manager}" 1>/dev/null 2>&1; then
               printf "%s" "${manager}"
               return 0
           fi
       done
       printf ""
       return 127
   }

   install_dep () {
       if [ -z "$1" ]; then
           manager="$(guess_manager)"
           if [ -z "${manager}" ]; then
               return 127
           fi
       else
           manager="${1}"
       fi
       eval "${manager}_install"
   }

   main() {
       install_dep "$@"
       case $? in
           0)
               printf "Dependencies installation complete\n"
               printf "Proceed to setup\n"
               ;;
           65)
               printf "Manager is available, but update threw error\n"
               printf "Please install dependencies manually\n"
               printf "aborting...\n"
               return 1;
               ;;
           66)
               printf "Manager is available, but package installation threw error\n"
               printf "Please install dependencies manually\n"
               printf "aborting...\n"
               return 1;
               ;;
           127)
               printf "Couldn't guess package manger\n"
               printf "Please install dependencies manually\n"
               printf "aborting...\n"
               return 127;
               ;;
           ,*) printf "Error number %s was thrown by the package manager\n" "$?"
              printf "Please install dependencies manually\n"
              printf "aborting...\n"
              ;;
       esac
   }

   main "$@"
#+end_src

* Set-up
- Affirm [[*Requirements][requirements]].
#+begin_warning
Do *NOT* use =sudo= during set-up.
#+end_warning

#+begin_warning
The next steps require you to delete all [[file:index.org::tab_locs][stowed dotfiles]].
We shall copy them in a directory named =${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG= before proceeding.
Preserve this backup, you will need this during undoing set-up.
- You HAVE BEEN warned.
#+end_warning

