docs/setup.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- Thu, 2024-07-18 10:40+0530 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Setup runcom</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Setup runcom</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge93bcae">Headers</a></li>
<li><a href="#orgabd888b">Legend</a>
<ul>
<li><a href="#org8cafe41">Brackets</a></li>
</ul>
</li>
<li><a href="#orgc868b0c">Requirements</a>
<ul>
<li><a href="#org6d015eb">Knowledge</a></li>
<li><a href="#orge308643">Dependencies</a></li>
</ul>
</li>
<li><a href="#org1133c81">Set-up</a>
<ul>
<li><a href="#orgafb49ed">Bootstrap set-up using script</a></li>
<li><a href="#org5150c81">Guide for manual set-up.</a></li>
</ul>
</li>
<li><a href="#org6e986fb">Undo Set-up</a>
<ul>
<li><a href="#org0276992">Bootstrap unset using script</a></li>
<li><a href="#org1d5fd7f">Guide to manually undo set-up.</a></li>
</ul>
</li>
<li><a href="#orgfc63cf2">Personalization</a>
<ul>
<li><a href="#org66b043f">Proxy settings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge93bcae" class="outline-2">
<h2 id="orge93bcae">Headers</h2>
</div>
<div id="outline-container-orgabd888b" class="outline-2">
<h2 id="orgabd888b">Legend</h2>
<div class="outline-text-2" id="text-orgabd888b">
</div>
<div id="outline-container-org8cafe41" class="outline-3">
<h3 id="org8cafe41">Brackets</h3>
<div class="outline-text-3" id="text-org8cafe41">
<ul class="org-ul">
<li><b>Square</b> <code>[]</code>: optional parts: <code>W[orld]H[ealth]O[rganisation]</code></li>
<li><b>Angular</b> <code>&lt;&gt;</code>: instructions to fill: <code>&lt;a global organisation&gt;</code></li>
<li><b>Curly</b>, following a dollar <code>${}</code>: environment variable <code>${HOME}</code></li>
<li><b>Round</b>, with bar separator: <code>(WHO|UNO)</code> = <i>WHO or UNO</i></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc868b0c" class="outline-2">
<h2 id="orgc868b0c">Requirements</h2>
<div class="outline-text-2" id="text-orgc868b0c">
</div>
<div id="outline-container-org6d015eb" class="outline-3">
<h3 id="org6d015eb">Knowledge</h3>
<div class="outline-text-3" id="text-org6d015eb">
<ul class="org-ul">
<li>Linux shell commands. We shall try to be POSIX-compliant</li>
<li>Knowledge of Linux, &ldquo;dot-files&rdquo;</li>
<li>super user (sudo) permissions (only for package installation)</li>
</ul>
<div class="warning" id="org3dcb749">
<p>
Avoid <b>sudo</b> as much as possible.
</p>

</div>
</div>
</div>

<div id="outline-container-orge308643" class="outline-3">
<h3 id="orge308643">Dependencies</h3>
<div class="outline-text-3" id="text-orge308643">
<ul class="org-ul">
<li>A GNU/Linux distribution.
I use <a href="https://archlinux.org">arch</a> <a href="https://knowyourmeme.com/memes/btw-i-use-arch">btw</a>.</li>
<li>GNU <a href="https://www.gnu.org/software/coreutils/coreutils.html">coreutils</a>: Basic OS utilities.</li>
<li><a href="https://curl.se/">curl</a> for proxy authentication.</li>
<li>GNU <a href="https://www.gnu.org/software/stow/">stow</a>: dot-file management</li>
<li><a href="https://git-scm.com/">git</a>: git it.</li>
</ul>

<div class="important" id="orgcbd778e">
<p>
For Alpine Linux, <a href="file:///etc/apk/repositories">enable</a> the <a href="https://&lt;mirror-server&gt;/alpine/%3Cversion%3E/community">community repository</a>.
</p>
<ul class="org-ul">
<li>If you are using Alpine, you <b>MUST</b> know how.</li>
</ul>

</div>
</div>

<div id="outline-container-org0c0ed3e" class="outline-4">
<h4 id="org0c0ed3e">Bootstrap installation of dependencies</h4>
<div class="outline-text-4" id="text-org0c0ed3e">
<p>
For automated installation of dependencies, run the <a href="./setup/dependencies.sh">dependencies script</a> with elevated privileges.
</p>
<div class="org-src-container">
<pre class="src src-sh">curl -sLf <span class="org-string">"https://pradyparanjpe.gitlab.io/runcom/setup/dependencies.sh"</span> | sudo sh
</pre>
</div>

<div class="note" id="org8133160">
<p>
Inspecting scripts before running them (especially with <code>sudo</code>) is always a good idea.
The <i>dependencies</i> script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, install dependencies manually instead, that&rsquo;s all it does.
</p>

</div>
</div>
</div>

<div id="outline-container-orgcd8741a" class="outline-4">
<h4 id="orgcd8741a">Guide for manual installation of dependencies.</h4>
<div class="outline-text-4" id="text-orgcd8741a">
<p>
Use suitable package manager (<a href="https://wiki.debian.org/Apt">apt</a>|<a href="https://pkgs.alpinelinux.org/packages">apk</a>|<a href="https://docs.fedoraproject.org/en-US/fedora/latest/system-administrators-guide/package-management/DNF/">dnf</a>|<a href="https://archlinux.org/pacman/">pacman</a>|<a href="https://documentation.suse.com/smart/linux/html/concept-zypper/index.html">zypper</a>) to install coreutils, curl, git, stow.
It may be useful to update existing packages and repository database before installing packages.
</p>
</div>
<ul class="org-ul">
<li><a id="org01416c2"></a>dnf: Fedora, RockyLinux, RHEL, CentOS<br />
<div class="outline-text-5" id="text-org01416c2">
<div class="org-src-container">
<pre class="src src-sh">dnf -y update || <span class="org-keyword">return</span> 65
dnf -y install coreutils curl git stow || <span class="org-keyword">return</span> 66
</pre>
</div>
</div>
</li>

<li><a id="org13adfb4"></a>apk: Alpine Linux<br />
<div class="outline-text-5" id="text-org13adfb4">
<div class="org-src-container">
<pre class="src src-sh">apk update || <span class="org-keyword">return</span> 65
apk --virtual runcom add coreutils curl git stow || <span class="org-keyword">return</span> 66
</pre>
</div>
</div>
</li>

<li><a id="orgf34a356"></a>apt: Debian, Ubuntu<br />
<div class="outline-text-5" id="text-orgf34a356">
<div class="org-src-container">
<pre class="src src-sh">apt update || <span class="org-keyword">return</span> 65
apt install -y coreutils curl git stow || <span class="org-keyword">return</span> 66
</pre>
</div>
</div>
</li>

<li><a id="org7cd1b4d"></a>zypper: OpenSuSE, SuSE<br />
<div class="outline-text-5" id="text-org7cd1b4d">
<div class="org-src-container">
<pre class="src src-sh">zypper ref || <span class="org-keyword">return</span> 65
zypper -n install coreutils curl git stow || <span class="org-keyword">return</span> 66
</pre>
</div>
</div>
</li>

<li><a id="org7cbaafe"></a>pacman: Arch, Manjaro<br />
<div class="outline-text-5" id="text-org7cbaafe">
<div class="org-src-container">
<pre class="src src-sh">pacman --noconfirm -Syu coreutils curl git stow || <span class="org-keyword">return</span> 65
</pre>
</div>
</div>
</li>

<li><a id="org7e7a9fc"></a>brew: Mac (untested)<br />
<div class="outline-text-5" id="text-org7e7a9fc">
<div class="org-src-container">
<pre class="src src-sh">brew update || <span class="org-keyword">return</span> 65
brew install coreutils curl git stow || <span class="org-keyword">return</span> 66
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1133c81" class="outline-2">
<h2 id="org1133c81">Set-up</h2>
<div class="outline-text-2" id="text-org1133c81">
<ul class="org-ul">
<li>Affirm <a href="#orgc868b0c">requirements</a>.</li>
</ul>
<div class="warning" id="orge946762">
<p>
Do <b>NOT</b> use <code>sudo</code> during set-up.
</p>

</div>

<div class="warning" id="org5782988">
<p>
The next steps require you to delete all <a href="index.html#orgc8affa0">stowed dotfiles</a>.
We shall copy them in a directory named <code>${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG</code> before proceeding.
Preserve this backup, you will need this during undoing set-up.
</p>
<ul class="org-ul">
<li>You HAVE BEEN warned.</li>
</ul>

</div>
</div>
