org/setup.org
** Bootstrap set-up using script
Set-up may be bootstrapped by running the [[./setup/setup.sh][setup]] script.
#+begin_src sh :tangle no
  curl -sLf "https://pradyparanjpe.gitlab.io/runcom/setup/setup.sh" | sh
#+end_src

#+begin_note
Inspecting scripts before running them is generally a good idea.
The /set-up/ script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, follow manual set-up instructions with modifications instead.
#+end_note

** Guide for manual set-up.
#+begin_src sh :tangle ../setup/setup.sh :exports none
  # @description Edit file in appropriate text editor
  # @param $1 file to edit
  # Caution zsh doesn't split _text_edit variable
  edit_text () {
      _text_edit="${FCEDIT:-${VISUAL:-${EDITOR}}}"
      if [ -z "$_text_edit" ]; then
          for avail in nvim nano vim vi ed; do
              if builtin command -v "${avail}" >/dev/null 2>&1; then
                  _text_edit="${avail}"
                  break
              fi
          done
      fi
      $_text_edit "$1"
      unset _text_edit
  }
#+end_src

*** Clone the repository and place at =${RUNCOMDIR}=
#+begin_src sh :tangle ../setup/setup.sh :exports none
  clone_repo () {
      if [ ! -d "${RUNCOMDIR:-${HOME}/.runcom}" ]; then
#+end_src

#+begin_src sh :tangle ../setup/setup.sh
  RUNCOMDIR="${HOME}/.runcom"
  git clone --recurse-submodules \
      "https://gitlab.com/pradyparanjpe/runcom" \
      "${RUNCOMDIR}" || exit 1
#+end_src

#+begin_src sh :tangle ../setup/setup.sh :exports none
  else
      printf "%s already exists. Quitting...\n" "${RUNCOMDIR}"
      exit 0
  fi
  }

   unsubscribe () {
#+end_src

*** Stow dot-files
**** Optionally, edit =stow='s local ignore file
#+begin_seealso
- [[file:index.org::#unstow][Unsubscription]]
#+end_seealso

Use following as a template and place it at =dotfiles/.stow-local-ignore=.
#+begin_src markdown :tangle ../setup/dot-stow-local-ignore
  ## Stow ignore
  ## See runcom's 'Unsubscription from configuration'
  ## See https://www.gnu.org/software/stow/manual/html_node/Ignore-Lists.html
  #
  ## Uncomment appropriate lines to unsubscribe. (remove the '# ')
  ## Comment for subscribe.
  #
  ## Configuration
  \.config/
  # \.config/qt5ct
  #
  ## local bin
  # \.local/bin
  #
  ## profile
  # \.profile\.d
  # \.profile\.d/auth
  #
  ## shrc
  # \.shrc\.d
  # \.shrc\.d/alternatives
  # \.shrc\.d/
#+end_src

Or copy it.
This ignore-file, being /gitignored/, will not be altered upon upstream edits.
#+begin_src sh :tangle ../setup/setup.sh
  cp --update=none "${RUNCOMDIR}/setup/dot-stow-local-ignore" \
     "${RUNCOMDIR}/dotfiles/.stow-local-ignore"
#+end_src

Before going ahead, edit the file =${RUNCOMDIR}/dotfiles/.stow-local-ignore= to unsubscribe some files.
#+begin_src sh :tangle ../setup/setup.sh :exports none
  printf "Unsubscribe from some upstream configuration? [y/N]:\t"
  read -r response
  if echo "${response}" | grep -iq "y"; then
      edit_text "${RUNCOMDIR}/dotfiles/.stow-local-ignore" || exit 0
  fi
  unset response
  }

   mask_stow_directories() {
#+end_src

#+begin_tip
- My configuration =.config= is ignored by default; because opt-In is better than opt-out.
  To subscribe to some of my personal configuration, comment out the =\.config/= entry.
- Read GNU stow's ignore-list for fine-grained control
#+end_tip

**** Preserve 'current' configuration
#+begin_src markdown :tangle ../setup/backup.md
  # RUNCOM backup
  This directory contains a backup of configuration that existed before runcom was setup.
  Files in this directory may be merged to their respective place after inspection.
  A corresponding entry should be added to the `RUNCOMDIR/dotfiles/.stow-local-ignore`.
  I recommend that this directory should **NOT** be deleted.
  It will be required to undo the setup.

  See [Runcom setup](https://pradyparanjpe.github.io/runcom/setup.html).
#+end_src

Create a directory to store current configuration in a *visible* folder in =${XDG_CACHE_HOME}=.
Place the above =README=.md that describes this directory.
#+begin_src sh :tangle ../setup/setup.sh
  presence="${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG"
  mkdir -p "${presence}"
  cp --update=none "${RUNCOMDIR}/setup/backup.md" "${presence}/README.md"
#+end_src

**** Move conflicting files to OLD_CONFIG.
#+begin_src sh :tangle ../setup/setup.sh
  stow --simulate --no-folding --dotfiles --verbose --stow \
       -t "${HOME}" \
       -d "${RUNCOMDIR}/" \
       dotfiles 2>&1 >/dev/null \
      | grep -o 'target \+\S\+\? ' \
      | cut -d' ' -f2 \
      | xargs -I{} mv {} "${presence}"/{}
#+end_src

