docs/setup.html

<div id="outline-container-orgafb49ed" class="outline-3">
<h3 id="orgafb49ed">Bootstrap set-up using script</h3>
<div class="outline-text-3" id="text-orgafb49ed">
<p>
Set-up may be bootstrapped by running the <a href="./setup/setup.sh">setup</a> script.
</p>
<div class="org-src-container">
<pre class="src src-sh">curl -sLf <span class="org-string">"https://pradyparanjpe.gitlab.io/runcom/setup/setup.sh"</span> | sh
</pre>
</div>

<div class="note" id="orgc6127c3">
<p>
Inspecting scripts before running them is generally a good idea.
The <i>set-up</i> script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, follow manual set-up instructions with modifications instead.
</p>

</div>
</div>
</div>

<div id="outline-container-org5150c81" class="outline-3">
<h3 id="org5150c81">Guide for manual set-up.</h3>
<div class="outline-text-3" id="text-org5150c81">
</div>
<div id="outline-container-org3bcccba" class="outline-4">
<h4 id="org3bcccba">Clone the repository and place at <code>${RUNCOMDIR}</code></h4>
<div class="outline-text-4" id="text-org3bcccba">
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">RUNCOMDIR</span>=<span class="org-string">"${HOME}/.runcom"</span>
git clone --recurse-submodules <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"https://gitlab.com/pradyparanjpe/runcom"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${RUNCOMDIR}"</span> || <span class="org-keyword">exit</span> 1
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5a539d" class="outline-4">
<h4 id="orgb5a539d">Stow dot-files</h4>
<div class="outline-text-4" id="text-orgb5a539d">
</div>
<ul class="org-ul">
<li><a id="orgf024a26"></a>Optionally, edit <code>stow</code>&rsquo;s local ignore file<br />
<div class="outline-text-5" id="text-orgf024a26">
<div class="seealso" id="orgfee809f">
<ul class="org-ul">
<li><a href="index.html#unstow">Unsubscription</a></li>
</ul>

</div>

<p>
Use following as a template and place it at <code>dotfiles/.stow-local-ignore</code>.
</p>
<div class="org-src-container">
<pre class="src src-markdown"><span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">Stow ignore</span>
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">See runcom's 'Unsubscription from configuration'</span>
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">See https://www.gnu.org/software/stow/manual/html_node/Ignore-Lists.html</span>
#
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">Uncomment appropriate lines to unsubscribe. (remove the '# ')</span>
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">Comment for subscribe.</span>
#
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">Configuration</span>
<span class="org-markdown-markup">\</span>.config/
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.config/qt5ct</span>
#
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">local bin</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.local/bin</span>
#
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">profile</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.profile</span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.d</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.profile</span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.d/auth</span>
#
<span class="org-markdown-header-delimiter">## </span><span class="org-markdown-header-face-2">shrc</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.shrc</span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.d</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.shrc</span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.d/alternatives</span>
<span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.shrc</span><span class="org-markdown-header-face-1"><span class="org-markdown-markup">\</span></span><span class="org-markdown-header-face-1">.d/</span>
</pre>
</div>

<p>
Or copy it.
This ignore-file, being <i>gitignored</i>, will not be altered upon upstream edits.
</p>
<div class="org-src-container">
<pre class="src src-sh">cp --update=none <span class="org-string">"${RUNCOMDIR}/setup/dot-stow-local-ignore"</span> <span class="org-sh-escaped-newline">\</span>
   <span class="org-string">"${RUNCOMDIR}/dotfiles/.stow-local-ignore"</span>
</pre>
</div>

<p>
Before going ahead, edit the file <code>${RUNCOMDIR}/dotfiles/.stow-local-ignore</code> to unsubscribe some files.
</p>
<div class="tip" id="org6ba809f">
<ul class="org-ul">
<li>My configuration <code>.config</code> is ignored by default; because opt-In is better than opt-out.
To subscribe to some of my personal configuration, comment out the <code>\.config/</code> entry.</li>
<li>Read GNU stow&rsquo;s ignore-list for fine-grained control</li>
</ul>

</div>
</div>
</li>

<li><a id="org5686bd9"></a>Preserve &rsquo;current&rsquo; configuration<br />
<div class="outline-text-5" id="text-org5686bd9">
<div class="org-src-container">
<pre class="src src-markdown"><span class="org-markdown-header-delimiter"># </span><span class="org-markdown-header-face-1">RUNCOM backup</span>
This directory contains a backup of configuration that existed before runcom was setup.
Files in this directory may be merged to their respective place after inspection.
A corresponding entry should be added to the <span class="org-markdown-markup">`</span><span class="org-markdown-inline-code">RUNCOMDIR/dotfiles/.stow-local-ignore</span><span class="org-markdown-markup">`</span>.
I recommend that this directory should <span class="org-markdown-markup">**</span><span class="org-markdown-bold">NOT</span><span class="org-markdown-markup">**</span> be deleted.
It will be required to undo the setup.

See <span class="org-markdown-markup">[</span><span class="org-markdown-link">Runcom setup</span><span class="org-markdown-markup">](</span><span class="org-markdown-url">https://pradyparanjpe.github.io/runcom/setup.html</span><span class="org-markdown-markup">)</span>.
</pre>
</div>

<p>
Create a directory to store current configuration in a <b>visible</b> folder in <code>${XDG_CACHE_HOME}</code>.
Place the above <code>README</code>.md that describes this directory.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">presence</span>=<span class="org-string">"${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG"</span>
mkdir -p <span class="org-string">"${presence}"</span>
cp --update=none <span class="org-string">"${RUNCOMDIR}/setup/backup.md"</span> <span class="org-string">"${presence}/README.md"</span>
</pre>
</div>
</div>
</li>

<li><a id="org6eb2e4c"></a>Move conflicting files to OLD_CONFIG.<br />
<div class="outline-text-5" id="text-org6eb2e4c">
<div class="org-src-container">
<pre class="src src-sh">stow --simulate --no-folding --dotfiles --verbose --stow <span class="org-sh-escaped-newline">\</span>
     -t <span class="org-string">"${HOME}"</span> <span class="org-sh-escaped-newline">\</span>
     -d <span class="org-string">"${RUNCOMDIR}/"</span> <span class="org-sh-escaped-newline">\</span>
     dotfiles 2&gt;&amp;1 &gt;/dev/null <span class="org-sh-escaped-newline">\</span>
    | grep -o <span class="org-string">'target \+\S\+\? '</span> <span class="org-sh-escaped-newline">\</span>
    | cut -d<span class="org-string">' '</span> -f2 <span class="org-sh-escaped-newline">\</span>
    | xargs -I<span class="org-rainbow-delimiters-depth-1">{}</span> mv <span class="org-rainbow-delimiters-depth-1">{}</span> <span class="org-string">"${presence}"</span>/<span class="org-rainbow-delimiters-depth-1">{}</span>
</pre>
</div>
</div>
</li>
