org/setup.org
**** Use =GNU stow= to create symlinked structure for all contents in =${RUNCOMDIR}/dotfiles= in =${HOME}=.
With the following options, if =stow= finds a pre-existing directory, symlinks are created inside that directory.
If =stow= finds a pre-existing file (non-directory), it throws error.
#+begin_src sh :tangle ../setup/setup.sh :exports none
  }

   stow_deploy() {
#+end_src

#+begin_src sh :tangle ../setup/setup.sh
  if stow --no-folding --dotfiles -v --restow \
          -t "${HOME}" \
          -d "${RUNCOMDIR}" \
          dotfiles ; then

      # Engrave RUNCOMDIR path
      mkdir -p "${HOME}/.profile.d/base_path"
      printf "RUNCOMDIR=\"%s\"\nexport RUNCOMDIR\n" "${RUNCOMDIR}" \
             > "${HOME}/.profile.d/00-base-path"
  else
      # stow threw error
      stow_error="$?"
      printf "Fix above errors and try again."
      exit "${stow_error}"
  fi
#+end_src

#+begin_src sh :tangle ../setup/setup.sh :exports none
  }
#+end_src

*** Set up HOMEs for Languages
    Cargo (RUST), GO clutter =${HOME}= with its /data/.
    Put it at the right place.
    Cargo's binaries, GOBIN should be installed in =${XDG_DATA_HOME}/../bin= like python3.
#+begin_src sh :tangle ../setup/setup.sh
  # @description
  # Move root of LANGuage named as (HOME/$1) to XDG_DATA_HOME/$1. e.g. ".cargo"
  #  Any leading dots are stripped to unhide.
  # Set Language ROOT Variable ($2) to point to that location. e.g. "CARGO_HOME"
  # Symlink ($3) bin location relative to ROOT to "XDG_DATA_HOME/../bin/".
  #   E.g. bin: ROOT/bin -> "XDG_DATA_HOME/../bin/". Default: bin
  # Set BINVAR ($4) to point to "XDG_DATA_HOME/../bin/". e.g. GOBIN.
  move_roots () {
      local_bin="$(realpath "${XDG_DATA_HOME:-${HOME}/.local/share}/../bin")"
      lang_home="${XDG_DATA_HOME:-${HOME}/.local/share}/${1##*.}"
      bad_lang_home="${HOME}/${1}"
      root_lang_bin="${lang_home}/${3:-bin}"
      if [ -d "${bad_lang_home}" ] && [ ! -L "${bad_lang_home}" ]; then
          printf "Moving %s to a better location, %s.\n" "${bad_lang_home}" \
                 "${lang_home}"
          mv "${bad_lang_home}" "${lang_home}"
      fi
      eval "${2}=\"${lang_home}\""
      export "${2?}"
      if [ ! "$(readlink -f "${root_lang_bin}")" = "${local_bin}" ]; then
          mv -t "${local_bin}" "${root_lang_bin}"/* 2>&1
          rmdir "${root_lang_bin}"
          ln -s "${local_bin}" "${root_lang_bin}"
      fi
      if [ -n "${4}" ]; then
          eval "${4}=${local_bin}"
          export "${4?}"
      fi
      unset local_bin lang_home bad_lang_home root_lang_bin
  }
#+end_src

#+begin_src sh :tangle ../setup/setup.sh :exports none
  main () {
      clone_repo
      mask_stow_directories
      unsubscribe
      stow_deploy
#+end_src

Move roots for CARGO_HOME and GOPATH to =${XDG_DATA_HOME}=.
#+begin_src sh :tangle ../setup/setup.sh
  move_roots .cargo CARGO_HOME
  move_roots go GOPATH
#+end_src

#+begin_todo
TODO: Add more languages.
#+end_todo

#+begin_src sh :tangle ../setup/setup.sh :exports none
  }

  main "$@"
#+end_src

#+begin_tip
- Remember to keep the repository updated.

#+begin_src sh :tangle no
    git pull --recurse-submodules
#+end_src
#+end_tip

* Undo Set-up
#+begin_warning
Do *NOT* use =sudo= during unset.
#+end_warning

#+begin_note
- The next steps will require a directory containing 'old configuration files'.
- You HAD BEEN warned against deleting it during the set-up.
#+end_note

** Bootstrap unset using script
   - Unset may be bootstrapped by running the [[./setup/unset.sh][unset]] script.
#+begin_src sh :tangle no
  curl -sLf "https://pradyparanjpe.gitlab.io/runcom/setup/unset.sh" | sh
#+end_src

#+begin_note
Inspecting scripts before running them is generally a good idea.
The /unset/ script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, follow manual unset instructions with modifications instead.
#+end_note

** Guide to manually undo set-up.
*** UnStow dot-files
Use =GNU stow= to unstow to un-linked structure for all contents in =${RUNCOMDIR}/dotfiles= from =${HOME}=.
**** RUNCOMDIR
We expect =$RUNCOMDIR= to be set via =${HOME}/.profile=.
Set it by hand otherwise.
#+begin_src sh :tangle ../setup/unset.sh :exports no
  RUNCOMDIR="${RUNCOMDIR:-${HOME}/.runcom}"
#+end_src

**** UnStow
#+begin_src sh :tangle no
  stow -v -t "${HOME}" -d "${RUNCOMDIR}" -D dotfiles
#+end_src

#+begin_src sh :tangle ../setup/unset.sh :exports none
  unstow_undeploy() {
      if ! stow -v -t "${HOME}" -d "${RUNCOMDIR}" -D dotfiles; then
          # stow threw error
          stow_error="$?"
          printf "Fix above errors and try again."
          exit "${stow_error}"
      fi
  }

  restore_configurations() {
#+end_src

