docs/setup.html

<li><a id="orgec04be8"></a>Use <code>GNU stow</code> to create symlinked structure for all contents in <code>${RUNCOMDIR}/dotfiles</code> in <code>${HOME}</code>.<br />
<div class="outline-text-5" id="text-orgec04be8">
<p>
With the following options, if <code>stow</code> finds a pre-existing directory, symlinks are created inside that directory.
If <code>stow</code> finds a pre-existing file (non-directory), it throws error.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">if</span> stow --no-folding --dotfiles -v --restow <span class="org-sh-escaped-newline">\</span>
        -t <span class="org-string">"${HOME}"</span> <span class="org-sh-escaped-newline">\</span>
        -d <span class="org-string">"${RUNCOMDIR}"</span> <span class="org-sh-escaped-newline">\</span>
        dotfiles ; <span class="org-keyword">then</span>

    <span class="org-comment-delimiter"># </span><span class="org-comment">Engrave RUNCOMDIR path</span>
    mkdir -p <span class="org-string">"${HOME}/.profile.d/base_path"</span>
    printf <span class="org-string">"RUNCOMDIR=\"%s\"\nexport RUNCOMDIR\n"</span> <span class="org-string">"${RUNCOMDIR}"</span> <span class="org-sh-escaped-newline">\</span>
           &gt; <span class="org-string">"${HOME}/.profile.d/00-base-path"</span>
<span class="org-keyword">else</span>
    <span class="org-comment-delimiter"># </span><span class="org-comment">stow threw error</span>
    <span class="org-variable-name">stow_error</span>=<span class="org-string">"$?"</span>
    printf <span class="org-string">"Fix above errors and try again."</span>
    <span class="org-keyword">exit</span> <span class="org-string">"${stow_error}"</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgfbb288d" class="outline-4">
<h4 id="orgfbb288d">Set up HOMEs for Languages</h4>
<div class="outline-text-4" id="text-orgfbb288d">
<p>
Cargo (RUST), GO clutter <code>${HOME}</code> with its <i>data</i>.
Put it at the right place.
Cargo&rsquo;s binaries, GOBIN should be installed in <code>${XDG_DATA_HOME}/../bin</code> like python3.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">@description</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Move root of LANGuage named as (HOME/$1) to XDG_DATA_HOME/$1. e.g. ".cargo"</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">Any leading dots are stripped to unhide.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Set Language ROOT Variable ($2) to point to that location. e.g. "CARGO_HOME"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Symlink ($3) bin location relative to ROOT to "XDG_DATA_HOME/../bin/".</span>
<span class="org-comment-delimiter">#   </span><span class="org-comment">E.g. bin: ROOT/bin -&gt; "XDG_DATA_HOME/../bin/". Default: bin</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Set BINVAR ($4) to point to "XDG_DATA_HOME/../bin/". e.g. GOBIN.</span>
<span class="org-function-name">move_roots</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">local_bin</span>=<span class="org-string">"$(realpath "${XDG_DATA_HOME:-${HOME}/.local/share}/../bin")"</span>
    <span class="org-variable-name">lang_home</span>=<span class="org-string">"${XDG_DATA_HOME:-${HOME}/.local/share}/${1##*.}"</span>
    <span class="org-variable-name">bad_lang_home</span>=<span class="org-string">"${HOME}/${1}"</span>
    <span class="org-variable-name">root_lang_bin</span>=<span class="org-string">"${lang_home}/${3:-bin}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -d <span class="org-string">"${bad_lang_home}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> -L <span class="org-string">"${bad_lang_home}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        printf <span class="org-string">"Moving %s to a better location, %s.\n"</span> <span class="org-string">"${bad_lang_home}"</span> <span class="org-sh-escaped-newline">\</span>
               <span class="org-string">"${lang_home}"</span>
        mv <span class="org-string">"${bad_lang_home}"</span> <span class="org-string">"${lang_home}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">eval</span> <span class="org-string">"${2}=\"${lang_home}\""</span>
    <span class="org-builtin">export</span> <span class="org-string">"${2?}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> <span class="org-string">"$(readlink -f "${root_lang_bin}")"</span> = <span class="org-string">"${local_bin}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        mv -t <span class="org-string">"${local_bin}"</span> <span class="org-string">"${root_lang_bin}"</span>/* 2&gt;&amp;1
        rmdir <span class="org-string">"${root_lang_bin}"</span>
        ln -s <span class="org-string">"${local_bin}"</span> <span class="org-string">"${root_lang_bin}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -n <span class="org-string">"${4}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        <span class="org-builtin">eval</span> <span class="org-string">"${4}=${local_bin}"</span>
        <span class="org-builtin">export</span> <span class="org-string">"${4?}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> local_bin lang_home bad_lang_home root_lang_bin
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<p>
Move roots for CARGO_HOME and GOPATH to <code>${XDG_DATA_HOME}</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh">move_roots .cargo CARGO_HOME
move_roots go GOPATH
</pre>
</div>

<div class="todo" id="org20f7182">
<p>
TODO: Add more languages.
</p>

</div>

<div class="tip" id="orgc16ec52">
<ul class="org-ul">
<li>Remember to keep the repository updated.</li>
</ul>

<div class="org-src-container">
<pre class="src src-sh">git pull --recurse-submodules
</pre>
</div>

</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org6e986fb" class="outline-2">
<h2 id="org6e986fb">Undo Set-up</h2>
<div class="outline-text-2" id="text-org6e986fb">
<div class="warning" id="orgd55b95b">
<p>
Do <b>NOT</b> use <code>sudo</code> during unset.
</p>

</div>

<div class="note" id="orgc3d8c94">
<ul class="org-ul">
<li>The next steps will require a directory containing &rsquo;old configuration files&rsquo;.</li>
<li>You HAD BEEN warned against deleting it during the set-up.</li>
</ul>

</div>
</div>

<div id="outline-container-org0276992" class="outline-3">
<h3 id="org0276992">Bootstrap unset using script</h3>
<div class="outline-text-3" id="text-org0276992">
<ul class="org-ul">
<li>Unset may be bootstrapped by running the <a href="./setup/unset.sh">unset</a> script.</li>
</ul>
<div class="org-src-container">
<pre class="src src-sh">curl -sLf <span class="org-string">"https://pradyparanjpe.gitlab.io/runcom/setup/unset.sh"</span> | sh
</pre>
</div>

<div class="note" id="org73e9468">
<p>
Inspecting scripts before running them is generally a good idea.
The <i>unset</i> script is tangled (with automation wrappers) from the code below.
If you feel an urge to inspect it or if it fails, follow manual unset instructions with modifications instead.
</p>

</div>
</div>
</div>

<div id="outline-container-org1d5fd7f" class="outline-3">
<h3 id="org1d5fd7f">Guide to manually undo set-up.</h3>
<div class="outline-text-3" id="text-org1d5fd7f">
</div>
<div id="outline-container-orgc9c6aed" class="outline-4">
<h4 id="orgc9c6aed">UnStow dot-files</h4>
<div class="outline-text-4" id="text-orgc9c6aed">
<p>
Use <code>GNU stow</code> to unstow to un-linked structure for all contents in <code>${RUNCOMDIR}/dotfiles</code> from <code>${HOME}</code>.
</p>
</div>
<ul class="org-ul">
<li><a id="org2680701"></a>RUNCOMDIR<br />
<div class="outline-text-5" id="text-org2680701">
<p>
We expect <code>$RUNCOMDIR</code> to be set via <code>${HOME}/.profile</code>.
Set it by hand otherwise.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-variable-name">RUNCOMDIR</span>=<span class="org-string">"${RUNCOMDIR:-${HOME}/.runcom}"</span>
</pre>
</div>
</div>
</li>

<li><a id="orgeaa03c5"></a>UnStow<br />
<div class="outline-text-5" id="text-orgeaa03c5">
<div class="org-src-container">
<pre class="src src-sh">stow -v -t <span class="org-string">"${HOME}"</span> -d <span class="org-string">"${RUNCOMDIR}"</span> -D dotfiles
</pre>
</div>
</div>
</li>
