org/setup.org
**** Restore directories form =${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG=
#+begin_src sh :tangle ../setup/unset.sh :exports none
  if [ ! -d "${1:-${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG}" ]; then
      printf "Old Configuration not found. Please supply as a positional argument.\n"
      printf "Such as %s <path/to/old/config/directory>\n" "$0"
      exit 1
  fi
#+end_src

Replace the target directory =${1:-${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG}= in following code block with <path/to/old/config/directory>.
#+begin_src sh :tangle ../setup/unset.sh
  for conf_dir in "${1:-${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG}"/*; do
      cp -r "${conf_dir}" "${HOME}"/. || break
  done

  # shellcheck disable=SC2181
  if [ $? -ne 0 ]; then
      printf "Restoration unsuccessful, copy backup files manually.\n"
  else
      printf "Restoration successful, backup directory may be deleted.\n"
  fi
#+end_src

*** Delete runcom
Goodbye

#+begin_src sh :tangle ../setup/unset.sh :exports none
  }

   delete_repo () {
#+end_src

#+begin_src sh :tangle ../setup/unset.sh
  rm -rf "${RUNCOMDIR}" && printf "Goodbye 👋\n"
#+end_src

*** Restore LANG_HOME
Move =${XDG_DATA_HOME}/LANG= to =${HOME}/.LANG=.
#+begin_src sh :tangle no
  # @description
  # Move root of LANGuage named as XDG_DATA_HOME/$1 back to (HOME/$1). e.g. ".cargo"
  #  Any leading dots are stripped to unhide.
  # Unset Language ROOT Variable ($2). e.g. "CARGO_HOME"
  # Let the symlinked bin to remain at "XDG_DATA_HOME/../bin/"
  # Unset BINVAR ${3} e.g. GOBIN.
  move_roots () {
      local_bin="$(realpath "${XDG_DATA_HOME:-${HOME}/.local/share}/../bin")"
      lang_home="${XDG_DATA_HOME:-${HOME}/.local/share}/${1##*.}"
      bad_lang_home="${HOME}/${1}"
      root_lang_bin="${lang_home}/${3:-bin}"
      if [ -d "${lang_home}" ] && [ ! -L "${lang_home}" ] && [ -L "${bad_lang_home}" ]; then
          rm "${bad_lang_home}"
          printf "Moving %s back to canonical location, %s.\n" \
                 "${lang_home}" "${bad_lang_home}"
          mv "${lang_home}" "${bad_lang_home}"
          unset "${2?}" "${4?}"
          export "${2?}" "${4?}"
      fi
      unset local_bin lang_home bad_lang_home root_lang_bin
  }
#+end_src

#+begin_src sh :tangle ../setup/unset.sh :exports none
  }

   main () {
       unstow_undeploy
       restore_configurations "$@"
       delete_repo
#+end_src

#+begin_src sh :tangle ../setup/unset.sh
  move_roots .cargo CARGO_HOME
  move_roots go GOPATH
#+end_src

#+begin_src sh :tangle ../setup/unset.sh :exports none
  }

   main "$@"
#+end_src

* Personalization
- To disable ui launch from =/dev/tty*=, set export environment variable =RUNCOM_LAUNCH_UI=false= in =~/.profile.d/UI=.

** Proxy settings
Read set up for [[./proxy_send.html][proxy_send]].
