docs/setup.html

<li><a id="orgd0e07c3"></a>Restore directories form <code>${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG</code><br />
<div class="outline-text-5" id="text-orgd0e07c3">
<p>
Replace the target directory <code>${1:-${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG}</code> in following code block with &lt;path/to/old/config/directory&gt;.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-keyword">for</span> conf_dir<span class="org-keyword"> in</span> <span class="org-string">"${1:-${XDG_CACHE_HOME:-${HOME}/.cache}/OLD_CONFIG}"</span>/*; <span class="org-keyword">do</span>
    cp -r <span class="org-string">"${conf_dir}"</span> <span class="org-string">"${HOME}"</span>/. || <span class="org-keyword">break</span>
<span class="org-keyword">done</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">shellcheck disable=SC2181</span>
<span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-1">[</span> $<span class="org-variable-name">?</span> -ne 0 <span class="org-rainbow-delimiters-depth-1">]</span>; <span class="org-keyword">then</span>
    printf <span class="org-string">"Restoration unsuccessful, copy backup files manually.\n"</span>
<span class="org-keyword">else</span>
    printf <span class="org-string">"Restoration successful, backup directory may be deleted.\n"</span>
<span class="org-keyword">fi</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org7ff6119" class="outline-4">
<h4 id="org7ff6119">Delete runcom</h4>
<div class="outline-text-4" id="text-org7ff6119">
<p>
Goodbye
</p>

<div class="org-src-container">
<pre class="src src-sh">rm -rf <span class="org-string">"${RUNCOMDIR}"</span> &amp;&amp; printf <span class="org-string">"Goodbye &#128075;\n"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc646654" class="outline-4">
<h4 id="orgc646654">Restore LANG_HOME</h4>
<div class="outline-text-4" id="text-orgc646654">
<p>
Move <code>${XDG_DATA_HOME}/LANG</code> to <code>${HOME}/.LANG</code>.
</p>
<div class="org-src-container">
<pre class="src src-sh"><span class="org-comment-delimiter"># </span><span class="org-comment">@description</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Move root of LANGuage named as XDG_DATA_HOME/$1 back to (HOME/$1). e.g. ".cargo"</span>
<span class="org-comment-delimiter">#  </span><span class="org-comment">Any leading dots are stripped to unhide.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Unset Language ROOT Variable ($2). e.g. "CARGO_HOME"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Let the symlinked bin to remain at "XDG_DATA_HOME/../bin/"</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Unset BINVAR ${3} e.g. GOBIN.</span>
<span class="org-function-name">move_roots</span> <span class="org-rainbow-delimiters-depth-1">()</span> <span class="org-rainbow-delimiters-depth-1">{</span>
    <span class="org-variable-name">local_bin</span>=<span class="org-string">"$(realpath "${XDG_DATA_HOME:-${HOME}/.local/share}/../bin")"</span>
    <span class="org-variable-name">lang_home</span>=<span class="org-string">"${XDG_DATA_HOME:-${HOME}/.local/share}/${1##*.}"</span>
    <span class="org-variable-name">bad_lang_home</span>=<span class="org-string">"${HOME}/${1}"</span>
    <span class="org-variable-name">root_lang_bin</span>=<span class="org-string">"${lang_home}/${3:-bin}"</span>
    <span class="org-keyword">if</span> <span class="org-rainbow-delimiters-depth-2">[</span> -d <span class="org-string">"${lang_home}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> <span class="org-negation-char">!</span> -L <span class="org-string">"${lang_home}"</span> <span class="org-rainbow-delimiters-depth-2">]</span> &amp;&amp; <span class="org-rainbow-delimiters-depth-2">[</span> -L <span class="org-string">"${bad_lang_home}"</span> <span class="org-rainbow-delimiters-depth-2">]</span>; <span class="org-keyword">then</span>
        rm <span class="org-string">"${bad_lang_home}"</span>
        printf <span class="org-string">"Moving %s back to canonical location, %s.\n"</span> <span class="org-sh-escaped-newline">\</span>
               <span class="org-string">"${lang_home}"</span> <span class="org-string">"${bad_lang_home}"</span>
        mv <span class="org-string">"${lang_home}"</span> <span class="org-string">"${bad_lang_home}"</span>
        <span class="org-builtin">unset</span> <span class="org-string">"${2?}"</span> <span class="org-string">"${4?}"</span>
        <span class="org-builtin">export</span> <span class="org-string">"${2?}"</span> <span class="org-string">"${4?}"</span>
    <span class="org-keyword">fi</span>
    <span class="org-builtin">unset</span> local_bin lang_home bad_lang_home root_lang_bin
<span class="org-rainbow-delimiters-depth-1">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">move_roots .cargo CARGO_HOME
move_roots go GOPATH
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgfc63cf2" class="outline-2">
<h2 id="orgfc63cf2">Personalization</h2>
<div class="outline-text-2" id="text-orgfc63cf2">
<ul class="org-ul">
<li>To disable ui launch from <code>/dev/tty*</code>, set export environment variable <code>RUNCOM_LAUNCH_UI=false</code> in <code>~/.profile.d/UI</code>.</li>
</ul>
</div>

<div id="outline-container-org66b043f" class="outline-3">
<h3 id="org66b043f">Proxy settings</h3>
<div class="outline-text-3" id="text-org66b043f">
<p>
Read set up for <a href="./proxy_send.html">proxy_send</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Pradyumna Paranjape</p>
<p class="date">Created: Thu, 2024-07-18 10:40+0530</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
